# 颠倒给定的 32 位无符号整数的二进制位。
#
# 输入：n = 00000010100101000001111010011100
# 输出：964176192 (00111001011110000010100101000000)
# 解释：输入的二进制串 00000010100101000001111010011100 表示无符号整数 43261596，
#      因此返回 964176192，其二进制表示形式为 00111001011110000010100101000000。
#
# 作者：力扣 (LeetCode)
# 链接：https://leetcode.cn/leetbook/read/top-interview-questions-easy/xnc5vg/
# 来源：力扣（LeetCode）
# 著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。


class Solution:
    def reverseBits(self, n: int) -> int:
        temp = bin(n)[:1:-1]
        result = temp + "0" * (32 - len(temp))
        return int(result, 2)


# 执行用时：36 ms, 在所有 Python3 提交中击败了80.79%的用户
# 内存消耗：14.7 MB, 在所有 Python3 提交中击败了89.77%的用户
# 通过测试用例：600 / 600



